##

# 테스트 문제

In [29]:
import seaborn as sns 

tips = sns.load_dataset("tips")
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

## 문제
- total_bill이 20보다 큰 행들만 필터링하세요.

In [22]:
# 코드
# .reset_index(drop=True) : 인덱스 재정렬하기
result1 = tips.loc[tips["total_bill"] >= 20, :].head(1).reset_index(drop=True)
result1

   total_bill  tip   sex smoker  day    time  size
0       21.01  3.5  Male     No  Sun  Dinner     3

- total_bill이 20보다 크고 tip이 3보다 큰 행들만 필터링하세요.

In [20]:
# 코드
result2 = tips.loc[(tips['total_bill'] >= 20) & (tips['tip'] >= 3), :].reset_index(drop=True)
result2

    total_bill   tip     sex smoker  day    time  size
0        21.01  3.50    Male     No  Sun  Dinner     3
1        23.68  3.31    Male     No  Sun  Dinner     2
2        24.59  3.61  Female     No  Sun  Dinner     4
3        25.29  4.71    Male     No  Sun  Dinner     4
4        26.88  3.12    Male     No  Sun  Dinner     4
..         ...   ...     ...    ...  ...     ...   ...
71       28.15  3.00    Male    Yes  Sat  Dinner     5
72       30.14  3.09  Female    Yes  Sat  Dinner     4
73       20.45  3.00    Male     No  Sat  Dinner     4
74       35.83  4.67  Female     No  Sat  Dinner     3
75       29.03  5.92    Male     No  Sat  Dinner     3

[76 rows x 7 columns]

## 문제 
- Sun, Sat만 출력

In [3]:
tips['day'].unique()

['Sun', 'Sat', 'Thur', 'Fri']
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']

In [24]:
# code
result2 = tips.loc[tips['day'].isin(['Sun','Sat'])].reset_index(drop=True).shape
result2

(163, 7)

## 문제
- New가 들어간 도시만 출력
- contains 메서드 활용

In [27]:
import pandas as pd

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'city': ['New York', 'Los Angeles', 'New Yorker', 'Chicago', 'New City'],
    'age': [25, 30, 35, 40, 45]
}

df = pd.DataFrame(data)
df

      name         city  age
0    Alice     New York   25
1      Bob  Los Angeles   30
2  Charlie   New Yorker   35
3    David      Chicago   40
4      Eva     New City   45

In [28]:
# code
df.loc[df['city'].str.contains('New'), :].reset_index(drop=True)

      name        city  age
0    Alice    New York   25
1  Charlie  New Yorker   35
2      Eva    New City   45